app/controllers/comentarios_controller.rb

SELECT * FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def show
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`created_at`, `updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`) VALUES('2010-08-18 23:59:35', '2010-08-18 23:59:35', 'TESTE COMENTARIO', 'Restaurante', 3)
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 3)
DELETE FROM `comentarios` WHERE `id` = 3
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy