app/controllers/restaurantes_controller.rb

  def index
#   @restaurantes = Restaurante.all
#   @restaurantes = Restaurante.find (:all, :order => "nome")

    @restaurantes = Restaurante.paginate :page => params['page'], :per_page=>3
---
SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`

  def show
    @restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 3)

  def create
    @restaurante = Restaurante.new(params[:restaurante])
    if @restaurante.save
---
INSERT INTO `restaurantes` (`endereco`, `created_at`, `nome`, `updated_at`, `especialidade`) VALUES('Teste', '2010-08-17 22:20:21', 'Teste', '2010-08-17 22:20:21', 'Teste')

  def edit
    @restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 3)

  def update
    @restaurante = Restaurante.find(params[:id])
    if @restaurante.update_attributes (params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 6)
UPDATE `restaurantes` SET `updated_at` = '2010-08-17 22:21:50', `nome` = 'Teste1' WHERE `id` = 6